# PROYECTO SQL

In [1]:
# Your import here:
import pylab as plt
import seaborn as sns
import matplotlib as plt
import pandas as pd
import numpy as np
import os
import warnings
warnings.filterwarnings('ignore') 
pd.set_option('display.max_columns', None)
import requests, json

# Exploracion de tablas

**Tabla actores**

In [2]:
actor = pd.read_csv('../data/actor.csv')

In [3]:
actor.shape

(200, 4)

In [4]:
nan_cols=actor.isna().sum()

nan_cols[nan_cols>1]

Series([], dtype: int64)

In [5]:
actor

     actor_id first_name     last_name          last_update
0           1   PENELOPE       GUINESS  2006-02-15 04:34:33
1           2       NICK      WAHLBERG  2006-02-15 04:34:33
2           3         ED         CHASE  2006-02-15 04:34:33
3           4   JENNIFER         DAVIS  2006-02-15 04:34:33
4           5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33
..        ...        ...           ...                  ...
195       196       BELA        WALKEN  2006-02-15 04:34:33
196       197      REESE          WEST  2006-02-15 04:34:33
197       198       MARY        KEITEL  2006-02-15 04:34:33
198       199      JULIA       FAWCETT  2006-02-15 04:34:33
199       200      THORA        TEMPLE  2006-02-15 04:34:33

[200 rows x 4 columns]

In [6]:
actor.drop_duplicates().shape==actor.shape

True

In [7]:
del(actor['last_update'])

In [8]:
actor.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   actor_id    200 non-null    int64
 1   first_name  200 non-null    object
 2   last_name   200 non-null    object
dtypes: int64(1), object(2)
memory usage: 4.8+ KB

In [9]:
#Crear columna de actor_name en Actor
actor['actor_name']=actor.first_name + '_'+ actor.last_name
actor

     actor_id first_name     last_name           actor_name
0           1   PENELOPE       GUINESS     PENELOPE_GUINESS
1           2       NICK      WAHLBERG        NICK_WAHLBERG
2           3         ED         CHASE             ED_CHASE
3           4   JENNIFER         DAVIS       JENNIFER_DAVIS
4           5     JOHNNY  LOLLOBRIGIDA  JOHNNY_LOLLOBRIGIDA
..        ...        ...           ...                  ...
195       196       BELA        WALKEN          BELA_WALKEN
196       197      REESE          WEST           REESE_WEST
197       198       MARY        KEITEL          MARY_KEITEL
198       199      JULIA       FAWCETT        JULIA_FAWCETT
199       200      THORA        TEMPLE         THORA_TEMPLE

[200 rows x 4 columns]

In [10]:
#Poner actor_name en la primera columna
first_column = actor.pop('actor_name') 
actor.insert(0, 'actor_name', first_column)
actor

              actor_name  actor_id first_name     last_name
0       PENELOPE_GUINESS         1   PENELOPE       GUINESS
1          NICK_WAHLBERG         2       NICK      WAHLBERG
2               ED_CHASE         3         ED         CHASE
3         JENNIFER_DAVIS         4   JENNIFER         DAVIS
4    JOHNNY_LOLLOBRIGIDA         5     JOHNNY  LOLLOBRIGIDA
..                   ...       ...        ...           ...
195          BELA_WALKEN       196       BELA        WALKEN
196           REESE_WEST       197      REESE          WEST
197          MARY_KEITEL       198       MARY        KEITEL
198        JULIA_FAWCETT       199      JULIA       FAWCETT
199         THORA_TEMPLE       200      THORA        TEMPLE

[200 rows x 4 columns]

In [11]:
actor.iloc[109]

actor_name    SUSAN_DAVIS
actor_id              110
first_name          SUSAN
last_name           DAVIS
Name: 109, dtype: object

In [12]:
actor.iloc[100]

actor_name    SUSAN_DAVIS
actor_id              101
first_name          SUSAN
last_name           DAVIS
Name: 100, dtype: object

In [13]:
actor[(actor.actor_name == "SUSAN_DAVIS")].index

Int64Index([100, 109], dtype='int64')

In [14]:
actor.drop(index = 100, inplace = True )

**Tabla categorias**

In [15]:
categoria = pd.read_csv('../data/category.csv')

In [16]:
categoria.shape

(16, 3)

In [17]:
nan_cols=categoria.isna().sum()

nan_cols[nan_cols>0]

Series([], dtype: int64)

In [18]:
categoria

    category_id         name          last_update
0             1       Action  2006-02-15 04:46:27
1             2    Animation  2006-02-15 04:46:27
2             3     Children  2006-02-15 04:46:27
3             4     Classics  2006-02-15 04:46:27
4             5       Comedy  2006-02-15 04:46:27
5             6  Documentary  2006-02-15 04:46:27
6             7        Drama  2006-02-15 04:46:27
7             8       Family  2006-02-15 04:46:27
8             9      Foreign  2006-02-15 04:46:27
9            10        Games  2006-02-15 04:46:27
10           11       Horror  2006-02-15 04:46:27
11           12        Music  2006-02-15 04:46:27
12           13          New  2006-02-15 04:46:27
13           14       Sci-Fi  2006-02-15 04:46:27
14           15       Sports  2006-02-15 04:46:27
15           16       Travel  2006-02-15 04:46:27

In [19]:
categoria.rename({'name': 'category_name'}, axis=1, inplace = True)

# Renombramos name por Category_name para que este todo mas claro.

In [20]:
categoria[(categoria.category_id == 10)].head()

   category_id category_name          last_update
9           10         Games  2006-02-15 04:46:27

In [21]:
categoria.drop_duplicates().shape==categoria.shape

True

In [22]:
categoria=categoria.drop_duplicates()

In [23]:
del(categoria['last_update'])

In [24]:
categoria.shape

(16, 2)

In [25]:
categoria.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 16 entries, 0 to 15
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   category_id    16 non-null     int64
 1   category_name  16 non-null     object
dtypes: int64(1), object(1)
memory usage: 384.0+ bytes

**Tabla Peliculas**

In [26]:
film = pd.read_csv('../data/film.csv')

In [27]:
film.shape

(1000, 13)

In [28]:
film.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [29]:
nan_cols=film.isna().sum()

nan_cols[nan_cols>1]

original_language_id    1000
dtype: int64

In [30]:
film.columns

Index(['film_id', 'title', 'description', 'release_year', 'language_id',
       'original_language_id', 'rental_duration', 'rental_rate', 'length',
       'replacement_cost', 'rating', 'special_features', 'last_update'],
      dtype='object')

In [31]:
# Todos los valores de esta columna son nulos 
# Esta columna no esta relacionada con ninguna otra tabla

del(film['original_language_id'])

#Elimino la columna Original Lenguage ID.

In [32]:
del(film['last_update'])

In [33]:
merged_inner[(merged_inner.film_id ==200 )].head()

NameError: name 'merged_inner' is not defined

In [34]:
film.drop_duplicates().shape==film.shape

True

In [35]:
film.rental_duration.unique

<bound method Series.unique of 0      6
1      3
2      7
3      5
4      6
      ..
995    6
996    4
997    6
998    5
999    3
Name: rental_duration, Length: 1000, dtype: int64>

In [36]:
film.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   film_id           1000 non-null   int64
 1   title             1000 non-null   object
 2   description       1000 non-null   object
 3   release_year      1000 non-null   int64
 4   language_id       1000 non-null   int64
 5   rental_duration   1000 non-null   int64
 6   rental_rate       1000 non-null   float64
 7   length            1000 non-null   int64
 8   replacement_cost  1000 non-null   float64
 9   rating            1000 non-null   object
 10  special_features  1000 non-null   object
dtypes: float64(2), int64(5), object(4)
memory usage: 86.1+ KB

In [81]:
merged_inner = pd.merge(left=film, right=newinventory, left_on='film_id', right_on='inventory_id')

In [83]:

del(merged_inner['film_id_y'])

In [85]:
merged_inner.rename({'film_id_x': 'film_id'}, axis=1, inplace = True)

In [86]:
merged_inner.tail()

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,inventory_id
995,996,YOUNG LANGUAGE,A Unbelieveable Yarn of a Boat And a Database ...,2006,1,6,0.99,183,9.99,G,"Trailers,Behind the Scenes",996
996,997,YOUTH KICK,A Touching Drama of a Teacher And a Cat who mu...,2006,1,4,0.99,179,14.99,NC-17,"Trailers,Behind the Scenes",997
997,998,ZHIVAGO CORE,A Fateful Yarn of a Composer And a Man who mus...,2006,1,6,0.99,105,10.99,NC-17,Deleted Scenes,998
998,999,ZOOLANDER FICTION,A Fateful Reflection of a Waitress And a Boat ...,2006,1,5,2.99,101,28.99,R,"Trailers,Deleted Scenes",999
999,1000,ZORRO ARK,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,"Trailers,Commentaries,Behind the Scenes",1000

In [ ]:
merged_inner.drop_duplicates().shape==merged_inner.shape

**Tabla inventario**

In [37]:
inventory = pd.read_csv('../data/inventory.csv')

In [38]:
inventory.shape

(1000, 4)

In [39]:
inventory['inventory_id']

0         1
1         2
2         3
3         4
4         5
       ...
995     996
996     997
997     998
998     999
999    1000
Name: inventory_id, Length: 1000, dtype: int64

In [40]:
del(inventory['last_update'])

# eliminamos la columna last_update porque no coincide con ninguna otra tabla los datos

In [41]:
inventory.drop_duplicates().shape==inventory.shape

True

In [42]:
inventory.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   inventory_id  1000 non-null   int64
 1   film_id       1000 non-null   int64
 2   store_id      1000 non-null   int64
dtypes: int64(3)
memory usage: 23.6 KB

In [43]:
inventory.head(20)

    inventory_id  film_id  store_id
0              1        1         1
1              2        1         1
2              3        1         1
3              4        1         1
4              5        1         2
5              6        1         2
6              7        1         2
7              8        1         2
8              9        2         2
9             10        2         2
10            11        2         2
11            12        3         2
12            13        3         2
13            14        3         2
14            15        3         2
15            16        4         1
16            17        4         1
17            18        4         1
18            19        4         1
19            20        4         2

In [44]:
newinventory = inventory

In [45]:
del(newinventory['store_id'])

In [46]:
inventory

     inventory_id  film_id
0               1        1
1               2        1
2               3        1
3               4        1
4               5        1
..            ...      ...
995           996      222
996           997      222
997           998      222
998           999      223
999          1000      223

[1000 rows x 2 columns]

**Tabla lenguaje**

In [47]:
language = pd.read_csv('../data/language.csv')

In [48]:
nan_cols=language.isna().sum()

nan_cols[nan_cols>1]

Series([], dtype: int64)

In [49]:
language.shape

(6, 3)

In [50]:
language

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19
5            6    German  2006-02-15 05:02:19

In [51]:
#Renombramos la columna name para que no coincida con otras.

language.rename({'name': 'language_name'}, axis=1, inplace = True)

In [52]:
del(language['last_update'])

In [53]:
language.drop_duplicates().shape==language.shape

True

In [54]:
language.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   language_id    6 non-null      int64
 1   language_name  6 non-null      object
dtypes: int64(1), object(1)
memory usage: 224.0+ bytes

**Tabla Misteriosa**

In [55]:
old = pd.read_csv('../data/old_HDD.csv')

In [56]:
old.shape

(1000, 5)

In [57]:
nan_cols=old.isna().sum()

nan_cols[nan_cols>1]

Series([], dtype: int64)

In [58]:
old

    first_name last_name                  title  release_year  category_id
0     PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1     PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2     PENELOPE   GUINESS            ANGELS LIFE          2006           13
3     PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4     PENELOPE   GUINESS          CHEAPER CLYDE          2006           14
..         ...       ...                    ...           ...          ...
995     GOLDIE     BRODY      COMANCHEROS ENEMY          2006            3
996     GOLDIE     BRODY        DAISY MENAGERIE          2006           14
997     GOLDIE     BRODY        DESERT POSEIDON          2006           11
998     GOLDIE     BRODY         EVERYONE CRAFT          2006            9
999     GOLDIE     BRODY         EXORCIST STING          2006           15

[1000 rows x 5 columns]

In [59]:
old[(old.title == 'CURTAIN VIDEOTAPE')].head()

    first_name last_name              title  release_year  category_id
192        JOE     SWANK  CURTAIN VIDEOTAPE          2006           10

In [60]:
old.drop_duplicates().shape==old.shape

True

In [61]:
old.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   first_name    1000 non-null   object
 1   last_name     1000 non-null   object
 2   title         1000 non-null   object
 3   release_year  1000 non-null   int64
 4   category_id   1000 non-null   int64
dtypes: int64(2), object(3)
memory usage: 39.2+ KB

In [62]:
old['actor_name']=old.first_name + '_'+ old.last_name
old

,first_name,last_name,title,release_year,category_id,actor_name
0,PENELOPE,GUINESS,ACADEMY DINOSAUR,2006,6,PENELOPE_GUINESS
1,PENELOPE,GUINESS,ANACONDA CONFESSIONS,2006,2,PENELOPE_GUINESS
2,PENELOPE,GUINESS,ANGELS LIFE,2006,13,PENELOPE_GUINESS
3,PENELOPE,GUINESS,BULWORTH COMMANDMENTS,2006,10,PENELOPE_GUINESS
4,PENELOPE,GUINESS,CHEAPER CLYDE,2006,14,PENELOPE_GUINESS
...,...,...,...,...,...,...
995,GOLDIE,BRODY,COMANCHEROS ENEMY,2006,3,GOLDIE_BRODY
996,GOLDIE,BRODY,DAISY MENAGERIE,2006,14,GOLDIE_BRODY
997,GOLDIE,BRODY,DESERT POSEIDON,2006,11,GOLDIE_BRODY
998,GOLDIE,BRODY,EVERYONE CRAFT,2006,9,GOLDIE_BRODY
999,GOLDIE,BRODY,EXORCIST STING,2006,15,GOLDIE_BRODY

In [63]:
first_column = old.pop('actor_name') 
old.insert(0, 'actor_name', first_column)
old

,actor_name,first_name,last_name,title,release_year,category_id
0,PENELOPE_GUINESS,PENELOPE,GUINESS,ACADEMY DINOSAUR,2006,6
1,PENELOPE_GUINESS,PENELOPE,GUINESS,ANACONDA CONFESSIONS,2006,2
2,PENELOPE_GUINESS,PENELOPE,GUINESS,ANGELS LIFE,2006,13
3,PENELOPE_GUINESS,PENELOPE,GUINESS,BULWORTH COMMANDMENTS,2006,10
4,PENELOPE_GUINESS,PENELOPE,GUINESS,CHEAPER CLYDE,2006,14
...,...,...,...,...,...,...
995,GOLDIE_BRODY,GOLDIE,BRODY,COMANCHEROS ENEMY,2006,3
996,GOLDIE_BRODY,GOLDIE,BRODY,DAISY MENAGERIE,2006,14
997,GOLDIE_BRODY,GOLDIE,BRODY,DESERT POSEIDON,2006,11
998,GOLDIE_BRODY,GOLDIE,BRODY,EVERYONE CRAFT,2006,9
999,GOLDIE_BRODY,GOLDIE,BRODY,EXORCIST STING,2006,15

In [64]:
old[(old.title == "ACADEMY DINOSAUR")].index

Int64Index([0, 212, 489, 780], dtype='int64')

In [65]:
old.iloc[212]

actor_name       CHRISTIAN_GABLE
first_name             CHRISTIAN
last_name                  GABLE
title           ACADEMY DINOSAUR
release_year                2006
category_id                    6
Name: 212, dtype: object

**Tabla alquileres**

In [66]:
rental = pd.read_csv('../data/rental.csv')

In [67]:
rental.shape

(1000, 7)

In [68]:
nan_cols=rental.isna().sum()

nan_cols[nan_cols>1]

Series([], dtype: int64)

In [76]:
rental

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,rental_duration
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,1
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,3
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,7
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,9
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,8
...,...,...,...,...,...,...,...
995,997,2005-05-31 00:08:25,4243,216,2005-06-02 00:17:25,2,2
996,998,2005-05-31 00:16:57,3395,389,2005-06-01 22:41:57,1,1
997,999,2005-05-31 00:25:10,4433,413,2005-06-03 06:05:10,2,3
998,1000,2005-05-31 00:25:56,1774,332,2005-06-08 19:42:56,2,8
999,1001,2005-05-31 00:46:31,1498,64,2005-06-06 06:14:31,2,6

In [70]:
del(rental['last_update'])

In [77]:
del(rental['return_date'])

In [75]:
rental.drop_duplicates().shape==rental.shape

True

In [73]:
rental['rental_duration'] = rental['return_date'] - rental['rental_date']

In [72]:
rental['rental_date'] = pd.to_datetime(rental['rental_date'])
rental['return_date'] = pd.to_datetime(rental['return_date'])

In [74]:
rental['rental_duration'] = (rental['return_date'] - rental['rental_date']).dt.days

# He creado otra columna con los dias de duracion del alquiler para poder relacionarlo con la tabla Films.

In [78]:
rental['rental_duration']=rental['rental_duration'].astype('int')

In [79]:
rental.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   rental_id        1000 non-null   int64
 1   rental_date      1000 non-null   datetime64[ns]
 2   inventory_id     1000 non-null   int64
 3   customer_id      1000 non-null   int64
 4   staff_id         1000 non-null   int64
 5   rental_duration  1000 non-null   int32
dtypes: datetime64[ns](1), int32(1), int64(4)
memory usage: 43.1 KB

In [ ]:
actor.to_csv('actor.csv', index = False)
language.to_csv('lenguage.csv', index = False)
rental.to_csv('rental.csv', index = False)
old.to_csv('old.csv', index = False)
categoria.to_csv('categoria.csv', index = False)
inventory.to_csv('inventory.csv', index = False)
merged_inner.to_csv('films.csv', index = False)

In [114]:
film_has_categoria.to_csv('film_has_categoria.csv',index = False)
film_has_actor.to_csv('film_has_actor.csv',index = False)
film_has_rental.to_csv('film_has_rental.csv',index = False)

# NUEVAS TABLAS

In [ ]:
# A PARTIR DE AQUI SE QUE ESTA MAL, PERO SINCERAMENTE NO SE HACERLO. ESPERO ENTENDERLO MAÃ‘ANA.

In [95]:
film_has_categoria = pd.DataFrame()

In [99]:
film_has_categoria['film_id'] = film['film_id']

In [102]:
film_has_categoria['category_id'] = categoria['category_id']

In [103]:
film_has_categoria.head(30)

    film_id  category_id
0         1          1.0
1         2          2.0
2         3          3.0
3         4          4.0
4         5          5.0
5         6          6.0
6         7          7.0
7         8          8.0
8         9          9.0
9        10         10.0
10       11         11.0
11       12         12.0
12       13         13.0
13       14         14.0
14       15         15.0
15       16         16.0
16       17          NaN
17       18          NaN
18       19          NaN
19       20          NaN
20       21          NaN
21       22          NaN
22       23          NaN
23       24          NaN
24       25          NaN
25       26          NaN
26       27          NaN
27       28          NaN
28       29          NaN
29       30          NaN

In [ ]:
film_actor = pd.merge(left=film, right=actor, left_on='film_id', right_on='inventory_id')

In [104]:
film_has_actor = pd.DataFrame()

In [108]:
film_has_actor['film_id'] = film['film_id']
film_has_actor['actor_id'] = actor['actor_id']

TypeError: cannot convert the series to <class 'int'>

In [107]:
film_has_actor.head(30)

    film_id  actor_id
0         1       1.0
1         2       2.0
2         3       3.0
3         4       4.0
4         5       5.0
5         6       6.0
6         7       7.0
7         8       8.0
8         9       9.0
9        10      10.0
10       11      11.0
11       12      12.0
12       13      13.0
13       14      14.0
14       15      15.0
15       16      16.0
16       17      17.0
17       18      18.0
18       19      19.0
19       20      20.0
20       21      21.0
21       22      22.0
22       23      23.0
23       24      24.0
24       25      25.0
25       26      26.0
26       27      27.0
27       28      28.0
28       29      29.0
29       30      30.0

In [109]:
film_has_actor.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   film_id   1000 non-null   int64
 1   actor_id  199 non-null    float64
dtypes: float64(1), int64(1)
memory usage: 15.8 KB

In [110]:
film_has_rental = pd.DataFrame()

In [111]:
film_has_rental['film_id'] = film['film_id']
film_has_rental['rental_id'] = rental['rental_id']

In [112]:
film_has_rental.head(30)

    film_id  rental_id
0         1          1
1         2          2
2         3          3
3         4          4
4         5          5
5         6          6
6         7          7
7         8          8
8         9          9
9        10         10
10       11         11
11       12         12
12       13         13
13       14         14
14       15         15
15       16         16
16       17         17
17       18         18
18       19         19
19       20         20
20       21         21
21       22         22
22       23         23
23       24         24
24       25         25
25       26         26
26       27         27
27       28         28
28       29         29
29       30         30